In [1]:
import numpy as np
import pandas as pd
import csv

In [2]:
# Creating a dataframe 
dframe = pd.DataFrame({
    "Col1":[1,2,3,np.nan,4], 
    "Col2":[2,np.nan,5,6,4], 
    "Col3":[np.nan,7,np.nan,9,6], 
    "Col4":[1,np.nan,np.nan,6,7]})

## 1. Create a CSV file named "output.csv" from this above given dataframe.

In [5]:
# Here we use to_csv() function to create an new file and flush the dframe to it
dframe.to_csv("output.csv",index = False)
# Remember to keep index as false or else an extra column will be create.

In [6]:
# Lets load the data as df and work on it
df = pd.read_csv("output.csv")
df.head()

   Col1  Col2  Col3  Col4
0   1.0   2.0   NaN   1.0
1   2.0   NaN   7.0   NaN
2   3.0   5.0   NaN   NaN
3   NaN   6.0   9.0   6.0
4   4.0   4.0   6.0   7.0

## 2. Replace all the missing values with the mean for that column with output rounded upto 3 digits.

In [12]:
# In python we can directly fill the values with .fillna() 
# Or else we can even get the mean of all the values and then replace the nan. 
df.fillna(df.mean(),inplace = True)
df

   Col1  Col2      Col3      Col4
0   1.0  2.00  7.333333  1.000000
1   2.0  4.25  7.000000  4.666667
2   3.0  5.00  7.333333  4.666667
3   2.5  6.00  9.000000  6.000000
4   4.0  4.00  6.000000  7.000000

In [17]:
# round() gives ur the round off of an digit, here I have given ndigit as 3 because I need 3 values
# Similarly if I wanted 2 I just need tol change the ndigit value.
print(round(df,ndigits = 3))

   Col1  Col2   Col3   Col4
0   1.0  2.00  7.333  1.000
1   2.0  4.25  7.000  4.667
2   3.0  5.00  7.333  4.667
3   2.5  6.00  9.000  6.000
4   4.0  4.00  6.000  7.000